# Рост дочерей 175, 167, 154, 174, 178, 148, 160, 167, 169, 170
# Рост матерей 178, 165, 165, 173, 168, 155, 160, 164, 178, 175
# Используя эти данные построить 95% доверительный интервал для разности среднего роста родителей и детей.
import numpy as np
import scipy.stats as stats

a = np.array([178, 165, 165, 173, 168, 155, 160, 164, 178, 175])
b = np.array([175, 167, 154, 174, 178, 148, 160, 167, 169, 170])
n1 = len(a) # 10
n2 = len(b) # 10
x1 = np.mean(a) # 168.1
x2 = np.mean(b) # 166.2
delta = x1 - x2 # 1.9000000000000057
D1 = np.var (a, ddof = 1) # 60.10000000000001
D2 = np.var (b, ddof = 1) # 91.06666666666666
D = (D1 - D2) / 2 # -15.483333333333327
SE = np.sqrt ((D / 10 + D / 10) * -1 ) # 1.7597348285087346
t = stats. t. ppf (0.975, 18) # 2.10092204024096
down = delta - t * SE 
up = delta + t * SE
print ([down, up]) # [-1.797065686193641, 5.597065686193652]

